Revit 2027 API
CompoundStructure.IsRectangularRegion Method
 Determines whether the specified region is rectangular.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRectangularRegion(
	int regionId
)
Public Function IsRectangularRegion (
	regionId As Integer
) As Boolean
public:
bool IsRectangularRegion(
	int regionId
)
member IsRectangularRegion :
        regionId : int -> bool
Parameters
regionId Int32
 The id of a region.
Return Value
Boolean
 True if the specified region is a rectangle, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  It is not a valid region id.
InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace